In [4]:
import pandas as pd
import numpy as np
import re

In [46]:
def carac_18_19(annee,sep):

    file = "Data/carac/caracteristiques_"+annee+".csv"
    dfcarac = pd.read_csv(file,sep=sep,
                          usecols=["jour","mois","an","hrmn","lum","dep","com","agg","int","atm","col","lat","long","Num_Acc"],
                          encoding="ISO-8859-1")
    dfcarac["an"] = annee                   
    dfcarac["hrmn"]=dfcarac["hrmn"].astype(str).str.replace(":","")
    dfcarac["hrmn"]=dfcarac["hrmn"].astype(str).apply(lambda x:x[:-2]+':'+x[-2:])
    dfcarac.drop(dfcarac[dfcarac["hrmn"].str.len()<4].index,inplace=True)
    dfcarac['Date'] = dfcarac["jour"].astype(str) + "-" +dfcarac["mois"].astype(str)+ "-" + dfcarac["an"].astype(str)
    dfcarac['Date'] = pd.to_datetime(dfcarac["Date"] + " " + dfcarac["hrmn"])
    dfcarac = dfcarac[["Date","lum","dep","com","agg","int","atm","col","lat","long","Num_Acc"]]
    #dfcarac = dfcarac.drop(['jour','mois','an','hrmn','adr'],axis=1)
    

    dfcarac['long']=dfcarac['long'].replace(',','.', regex=True).apply(pd.to_numeric,errors='coerce')
    dfcarac['lat']=dfcarac['lat'].replace(',','.', regex=True).apply(pd.to_numeric,errors='coerce')

    #dfcarac.set_index("Num_Acc", drop=True, append=False, inplace=True, verify_integrity=True) #suppression doublons
    return dfcarac


def lieux_18_19(annee,sep):
    file = "Data/lieux/lieux_"+annee+".csv"
    dflieux = pd.read_csv(file,sep=sep,usecols=["catr","surf","infra","situ","prof","plan","larrout","lartpc","circ","nbv","vma","Num_Acc"])
    #dflieux = dflieux[["catr","surf","infra","Num_Acc"]]
    #dflieux = dflieux.drop(["pr","pr1","plan","lartpc","larrout","situ","v1","nbv","v2","vosp","prof","circ","vma",'voie'],axis=1)
    #dflieux.set_index("Num_Acc", drop=True, append=False, inplace=True, verify_integrity=True) #suppression doublons
    return dflieux

def vehic_18_19(annee,sep):
    file = "Data/vehic/vehicules_"+annee+".csv"
    dfvehic=pd.read_csv(file,sep=sep,usecols=["catv","obs","choc","obsm","manv","motor","num_veh","id_vehicule","Num_Acc"])
    #dfvehic=dfvehic[["catv","obsm","Num_Acc"]]
    #dfvehic.drop(["num_veh","senc","manv","occutc","motor",'obs',"choc","id_vehicule"],axis=1,inplace=True)
    #dfvehic.drop_duplicates(subset ="Num_Acc", keep = 'first', inplace=True) #suppression doublons
    #dfvehic.set_index("Num_Acc", drop=True, append=False, inplace=True, verify_integrity=True) #suppression doublons
    return dfvehic

def usagers_18_19(annee,sep):
    file = "Data/user/usagers_"+annee+".csv"
    dfuser=pd.read_csv(file,sep=sep,usecols=["place","catu","grav","sexe","an_nais","trajet","secu1","secu2","secu3","locp","actp","etatp","num_veh","id_vehicule","Num_Acc"])
    #dfvehic=dfvehic[["catv","obsm","Num_Acc"]]
    #dfvehic.drop(["num_veh","senc","manv","occutc","motor",'obs',"choc","id_vehicule"],axis=1,inplace=True)
    #dfvehic.drop_duplicates(subset ="Num_Acc", keep = 'first', inplace=True) #suppression doublons
    #dfvehic.set_index("Num_Acc", drop=True, append=False, inplace=True, verify_integrity=True) #suppression doublons
    return dfuser

In [52]:
dfcarac19 = carac_18_19("2019",';')
dflieux19 = lieux_18_19("2019",';')
dfvehic19 = vehic_18_19("2019",';')
dfuser19 = usagers_18_19("2019",';')

In [48]:
dfcarac19

,Date,lum,dep,com,agg,int,atm,col,lat,long,Num_Acc
0,2019-11-30 01:30:00,4,93,93053,1,1,1,2,48.896210,2.470120,201900000001
1,2019-11-30 02:50:00,3,93,93066,1,1,1,6,48.930700,2.368800,201900000002
2,2019-11-28 15:15:00,1,92,92036,1,1,1,4,48.935872,2.319174,201900000003
3,2019-11-30 20:20:00,5,94,94069,1,1,1,4,48.817329,2.428150,201900000004
4,2019-11-30 04:00:00,3,94,94028,1,1,1,2,48.776362,2.433254,201900000005
...,...,...,...,...,...,...,...,...,...,...,...
58835,2019-11-30 09:00:00,1,69,69288,1,1,5,2,45.666660,5.056120,201900058836
58836,2019-11-27 07:50:00,1,67,67482,1,1,8,4,48.576900,7.726900,201900058837
58837,2019-11-30 02:41:00,4,94,94021,1,1,1,6,48.771700,2.345760,201900058838
58838,2019-11-30 15:20:00,1,78,78640,1,1,1,7,48.777289,2.223759,201900058839
58839,2019-11-29 20:50:00,3,92,92047,1,1,1,2,48.835124,2.175110,201900058840

In [49]:
dflieux19

,Num_Acc,catr,circ,nbv,prof,plan,lartpc,larrout,surf,infra,situ,vma
0,201900000001,1,3,10,1,2,NaN,NaN,1,2,1,70
1,201900000002,1,1,2,4,2,NaN,NaN,1,0,1,70
2,201900000003,1,3,8,1,3,NaN,NaN,1,0,1,90
3,201900000004,1,3,5,1,1,NaN,NaN,1,0,1,90
4,201900000005,1,1,3,1,3,NaN,NaN,1,2,1,90
...,...,...,...,...,...,...,...,...,...,...,...,...
58835,201900058836,1,1,3,1,1,NaN,NaN,2,3,1,130
58836,201900058837,1,1,2,1,1,NaN,NaN,2,0,1,90
58837,201900058838,1,3,3,1,1,NaN,NaN,1,0,1,90
58838,201900058839,1,1,1,1,3,NaN,NaN,1,0,1,50
58839,201900058840,1,1,3,1,1,NaN,NaN,1,0,2,110

In [50]:
dfvehic19

             Num_Acc  id_vehicule num_veh  catv  obs  obsm  choc  manv  motor
0       201900000001  138 306 524     B01     7    0     2     5    23      1
1       201900000001  138 306 525     A01    17    1     0     3    11      1
2       201900000002  138 306 523     A01     7    4     0     1     0      1
3       201900000003  138 306 520     A01     7    0     2     1     2      1
4       201900000003  138 306 521     B01     7    1     0     4     2      1
...              ...          ...     ...   ...  ...   ...   ...   ...    ...
100705  201900058837  137 982 135     C01     7    0     2     1     2      1
100706  201900058838  137 982 132     A01     7    3     0     1    21      0
100707  201900058839  137 982 131     A01    33    0     0     7     1      1
100708  201900058840  137 982 129     B01    10    0     2     4     0      2
100709  201900058840  137 982 130     A01    10    0     2     1     0      1

[100710 rows x 9 columns]

In [51]:
dfuser19

,Num_Acc,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,secu3,locp,actp,etatp
0,201900000001,138 306 524,B01,2,2,4,2,2002,0,1,0,-1,-1,-1,-1
1,201900000001,138 306 524,B01,1,1,4,2,1993,5,1,0,-1,-1,-1,-1
2,201900000001,138 306 525,A01,1,1,1,1,1959,0,1,0,-1,-1,-1,-1
3,201900000002,138 306 523,A01,1,1,4,2,1994,0,1,0,-1,-1,-1,-1
4,201900000003,138 306 520,A01,1,1,1,1,1996,0,1,0,-1,-1,0,-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
132972,201900058837,137 982 135,C01,1,1,4,2,1988,1,1,0,-1,-1,-1,-1
132973,201900058838,137 982 132,A01,1,1,4,1,1998,9,1,0,-1,-1,-1,-1
132974,201900058839,137 982 131,A01,1,1,3,1,1979,0,2,0,-1,-1,-1,-1
132975,201900058840,137 982 129,B01,1,1,4,1,1974,0,1,0,-1,-1,0,-1
132976,201900058840,137 982 130,A01,1,1,1,1,1971,0,1,-1,-1,0,0,-1

In [10]:
dfcarac = carac_18_19("2009",'\t')
dfcarac

,Date,lum,dep,com,agg,int,atm,col,lat,long,Num_Acc
0,2009-01-30 20:30:00,3,440,67,1,1,1.0,6,0.0,0.0,200900000001
1,2009-01-17 03:00:00,3,440,17,1,1,1.0,3,0.0,0.0,200900000002
2,2009-01-29 06:45:00,3,440,52,1,1,1.0,3,0.0,0.0,200900000003
3,2009-04-01 06:15:00,3,440,44,1,1,9.0,6,0.0,0.0,200900000004
4,2009-01-16 15:00:00,1,440,36,1,1,1.0,7,0.0,0.0,200900000005
...,...,...,...,...,...,...,...,...,...,...,...
74404,2009-11-17 17:40:00,1,972,13,1,1,1.0,2,NaN,NaN,200900074719
74405,2009-11-21 21:00:00,3,972,13,1,1,1.0,2,NaN,NaN,200900074720
74406,2009-01-11 11:20:00,1,972,13,1,1,1.0,5,NaN,NaN,200900074721
74407,2009-08-11 15:40:00,1,974,9,2,1,1.0,7,NaN,NaN,200900074722
74408,2009-03-04 12:25:00,1,973,2,1,3,1.0,3,NaN,NaN,200900074898

In [124]:
dfcarac

,Date,lum,dep,com,agg,int,atm,col,lat,long
Num_Acc,,,,,,,,,,
200800000001,2008-01-22 10:15:00,1,330,424,2,1,1,6,4515400.0,-82600.0
200800000002,2008-10-01 08:15:00,1,330,348,1,1,1,7,0.0,0.0
200800000003,2008-01-16 08:00:00,2,330,350,2,1,1,3,4478200.0,-12500.0
200800000004,2008-01-20 11:00:00,1,330,394,1,1,1,2,4491400.0,-19900.0
200800000005,2008-01-25 06:45:00,5,330,394,2,1,1,3,4490000.0,-15500.0
...,...,...,...,...,...,...,...,...,...,...
200800077565,2008-09-12 14:05:00,1,974,414,2,1,2,7,NaN,NaN
200800077566,2008-12-19 16:35:00,1,974,416,2,1,1,3,NaN,NaN
200800077567,2008-12-19 17:15:00,1,974,416,2,3,9,1,NaN,NaN
200800077568,2008-12-23 16:30:00,1,974,416,2,1,1,6,NaN,NaN
200800077569,2008-03-12 08:00:00,1,974,414,2,2,1,3,NaN,NaN

In [ ]:
dfcarac["dep"]

In [94]:
dfcarac = pd.read_csv(carac+"caracteristiques_2008.csv",sep=',',
                          usecols=["jour","mois","an","hrmn","lum","dep","com","agg","int","atm","col","lat","long","Num_Acc"],
                          encoding="ISO-8859-1"
                         )
dfcarac["an"] = "2008"
dfcarac['Date'] = dfcarac["jour"].astype(str) + "-" +dfcarac["mois"].astype(str)+ "-" + dfcarac["an"].astype(str)
dfcarac["hrmn"]=dfcarac["hrmn"].astype(str).apply(lambda x:x[:-2]+':'+x[-2:])
#dfcarac["hrmn"]
#dfcarac['Date'] = pd.to_datetime(dfcarac["Date"] + " " + dfcarac["hrmn"])
dfcarac.drop(dfcarac[dfcarac["hrmn"].str.len()<4].index,inplace=True)
dfcarac[dfcarac["hrmn"].str.len()<4]

Empty DataFrame
Columns: [Num_Acc, an, mois, jour, hrmn, lum, agg, int, atm, col, com, lat, long, dep, Date]
Index: []

In [66]:
dff = pd.read_csv(carac+"caracteristiques-2019.csv",sep=';',
                          usecols=["jour","mois","an","hrmn","lum","dep","com","agg","int","atm","col","lat","long","Num_Acc"],
                          encoding="ISO-8859-1"
                         )
dff["hrmn"].str.replace(":","")

0        0130
1        0250
2        1515
3        2020
4        0400
         ...
58835    0900
58836    0750
58837    0241
58838    1520
58839    2050
Name: hrmn, Length: 58840, dtype: object

In [26]:
df2019 = pd.concat([dfcarac19, dflieux19,dfvehic19],axis=1)
mapping_catv = {7:"Véhicule Léger",
                33:"2 Roues Motorisé",
                10:"Véhicule Utilitaire",
                1:"EDP",
                2:"2 Roues Motorisé",
                30:"2 Roues Motorisé",
                32:"2 Roues Motorisé",
                31:"2 Roues Motorisé",
                34:"2 Roues Motorisé",
                3:"Voiturette",
                15:"Poids Lourd",
                37:"Bus",
                17:"Poids Lourd",
                14:"Poids Lourd",
                50:"EDP",
                43:"2 Roues Motorisé",
                13:"Poids Lourd",
                80:"EDP",
                21:"Engin Spécial",
                36:"2 Roues Motorisé",
                20:"Engin Spécial",
                38:"Bus",
                60:"EDP",
                16:"Poids Lourd",
                42:"2 Roues Motorisé",
                35:"2 Roues Motorisé",
                31:"2 Roues Motorisé",
                }

mapping_col = {1:"Frontale",2:"Arriere",3:"Latérale",4:"En chaîne",5:"Multiple",7:"Sans collision"}

mapping_lum = {1:"Plein jour",2:"Crépuscule ou aube",3:"Nuit sans éclairage",4:"Nuit sans éclairage",5:"Nuit avec éclairage"}

mapping_agg = {1:"Hors agglomération",2:"En agglomération"}

mapping_int = {1:"Hors intersection",
               2:"Intersection en X",
               3:"Intersection en Y",
               4:"Intersection a plus de 4 branches",
               6:"Giratoire",
               7:"Place",
               8:"Passage à niveau"
              }

mapping_atm = {1:"Normale",
               2:"Pluie legère",
               3:"Pluie forte",
               4:"Neige",
               5:"Brouillard",
               6:"Vent fort",
               7:"Temps éblouissant",
               8:"Temps couvert"
              }

mapping_catr = {1:"Autoroute",
                2:"Route nationale",
                3:"Route départemantale",
                4:"Voie communale",
                5:"Hors réseau public",
                6:"Parc de stationnement",
                7:"Routes de métropole urbaine"
               }

mapping_surf = {1:"Normale",
                2:"Mouillée",
                3:"Flaques",
                4:"Inondée",
                5:"Enneigée",
                6:"Boue",
                7:"Verglas",
                8:"Corps gras",
               }

mapping_obsm = {0:"Aucun",1:"Piéton",2:"Véhicule",5:"Animal",6:"Animal"}

mapping_infra = {0:"Aucun",1:"Tunnel",2:"Pont",3:"Bretelle",4:"Voie ferrée",5:"Carrefour",6:"Zone piétone",
                 7:"Zone de péage",8:"Chantier"}

df2019["col"] = df2019["col"].map(mapping_col)
df2019["catv"] = df2019["catv"].map(mapping_catv)
df2019["lum"] = df2019["lum"].map(mapping_lum)
df2019["agg"] = df2019["agg"].map(mapping_agg)
df2019["int"] = df2019["int"].map(mapping_int)
df2019["atm"] = df2019["atm"].map(mapping_atm)
df2019["catr"] = df2019["catr"].map(mapping_catr)
df2019["surf"] = df2019["surf"].map(mapping_surf)
df2019["obsm"] = df2019["obsm"].map(mapping_obsm)
df2019["infra"] = df2019["infra"].map(mapping_infra)

df2019.dropna(inplace=True)
# df2019.loc[df2019["catr"] == 'Autoroute',"voie"] = 'A' + df2019.loc[df2019["catr"] == 'Autoroute',"voie"].apply(str)
# df2019.loc[df2019["catr"] == 'Route nationale',"voie"] = 'N' + df2019.loc[df2019["catr"] == 'Route nationale',"voie"].apply(str)
# df2019.loc[df2019["catr"] == 'Route départemantale',"voie"] = 'D' + df2019.loc[df2019["catr"] == 'Route départemantale',"voie"].apply(str)

In [27]:
df2019["obsm"].value_counts()

Véhicule    28219
Aucun        6865
Piéton        646
Animal        247
Name: obsm, dtype: int64